"""
Найти сумму n элементов следующего ряда чисел:
1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.
Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75
Решите через рекурсию. В задании нельзя применять циклы.
Нужно обойтисть без создания массива!
"""

def summator(h):
    k = h - 1
    if h == 0:
        return []
    return summator(k) + [(-1) ** (k % 2) / (1 << k)]
n = int(input('Введите количество элементов: '))

print(f'Количество элементов - {n}, а их сумма - {sum(summator(n))}')